In [63]:
import pandas as pd


ratings = pd.read_csv('testCase.csv')

df = pd.DataFrame(ratings)

In [64]:
ratings.head()

  book_name  ratings  user_id
0    Book 1        4        1
1    Book 1        4        2
2    Book 1        4        3
3    Book 1        4        4
4    Book 1        4        5

In [65]:
bookRatings = ratings.pivot_table(index=['user_id'],columns=['book_name'],values='ratings')
bookRatings[156:166]

#pivot_table function on a DataFrame will construct a user / book rating matrix

book_name  Book 1  Book 2  Book 3  Book 4
user_id
158           5.0     5.0     NaN     NaN
159           5.0     5.0     NaN     NaN
160           5.0     5.0     NaN     NaN
161           5.0     5.0     NaN     NaN
162           5.0     5.0     NaN     NaN
163           5.0     5.0     NaN     NaN
164           5.0     5.0     NaN     NaN
165           5.0     5.0     NaN     NaN
166           5.0     5.0     NaN     NaN
167           5.0     5.0     NaN     NaN

In [66]:
#users who rated book & entering input (book to search for similarity):
input = "Book 1"
x = bookRatings[input]
x[1:20]

user_id
2     4.0
3     4.0
4     4.0
5     4.0
6     4.0
7     4.0
8     4.0
9     4.0
10    4.0
11    4.0
12    4.0
13    4.0
14    4.0
15    4.0
16    4.0
17    4.0
18    4.0
19    4.0
20    4.0
Name: Book 1, dtype: float64

In [67]:
# corrwith function makes it really easy to compute the pairwise correlation
# Showing the relation between the books and other books based on rating
 
similarBooks = bookRatings.corrwith(x)
similarBooks = similarBooks.dropna()
df = pd.DataFrame(similarBooks)
df.head()

             0
book_name
Book 1     1.0
Book 2     1.0

In [68]:
# Getting the Similar Books according to the rating and users

similarBooks.sort_values(ascending=False)

book_name
Book 1    1.0
Book 2    1.0
dtype: float64

In [69]:
# get rid of the unpopluar books who may mess up our results (missing more rating).
# counts up how many ratings exist for each book and the average rate.


import numpy as np
BookStats = ratings.groupby('book_name').agg({'ratings': [np.size, np.mean]})

In [70]:

popularBooks = BookStats['ratings']['size'] >= 20
BookStats[popularBooks].sort_values([('ratings', 'mean')], ascending=False)[:15]

print(popularBooks)

book_name
Book 1    True
Book 2    True
Book 3    True
Book 4    True
Name: size, dtype: bool

In [71]:
# Applying the new List of books (has 40 rating at least) to results
df = BookStats[popularBooks].join(pd.DataFrame(similarBooks, columns=['similarity']))

C:\Users\lenovo\AppData\Local\Temp\ipykernel_44980\4088160253.py:2: FutureWarning: merging between different levels is deprecated and will be removed in a future version. (2 levels on the left, 1 on the right)
  df = BookStats[popularBooks].join(pd.DataFrame(similarBooks, columns=['similarity']))

In [72]:
df.head()

           (ratings, size)  (ratings, mean)  similarity
book_name
Book 1                 198              4.5         1.0
Book 2                 198              4.5         1.0
Book 3                  49              2.0         NaN
Book 4                  29              2.0         NaN

In [73]:
# taking Top 3 books based on similarity for our specfied book (input best match) 
results = df.sort_values(['similarity'], ascending=False)[1:4]

In [74]:
#printing the recommended books to the user
firstBook = results[:1].index[0]
SecondBook = results[1:2].index[0]
ThirdBook = results[2:3].index[0]

print("Recommended books:")
print("First Book:" , firstBook)
print("Second Book:" , SecondBook)
print("Third Book:" , ThirdBook)

Recommended books:
First Book: Book 2
Second Book: Book 3
Third Book: Book 4